# ExportFontInfo Constructor (String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontInfo Constructor (String)
ExportFontInfo Class See Also
---
Constructs a new ExportFontInfo using the destination font name as input.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportFontInfo(
	string destinationFontName
)
```

Visual Basic
---
```text
Public Sub New ( _
	destinationFontName As String _
)
```

Visual C++
---
```text
public:
ExportFontInfo(
	String^ destinationFontName
)
```

# ### Parameters
destinationFontName
    Type: System..::..String The destination font name (the name of the font in the exported format).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportFontInfo Class
ExportFontInfo Overload
Autodesk.Revit.DB Namespace